In [1]:
import pandas as pd

df = pd.DataFrame({
    'kota' : ['Malang', 'Surabaya', 'Jakarta', 'Bandung', 'Denpasar'],
    'umur' : [44, 34, 46, 35, 23],
    'gaji' : [72000, 65000, 98000, 45000, 34000]
})
df

       kota  umur   gaji
0    Malang    44  72000
1  Surabaya    34  65000
2   Jakarta    46  98000
3   Bandung    35  45000
4  Denpasar    23  34000

In [2]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['kota'] = label_encoder.fit_transform(df['kota'])
df

   kota  umur   gaji
0     3    44  72000
1     4    34  65000
2     2    46  98000
3     0    35  45000
4     1    23  34000

In [3]:
label_encoder.classes_

array(['Bandung', 'Denpasar', 'Jakarta', 'Malang', 'Surabaya'],
      dtype=object)

In [4]:
df = pd.DataFrame({
    'kota' : ['Malang', 'Surabaya', 'Jakarta', 'Bandung', 'Denpasar'],
    'umur' : [44, 34, 46, 35, 23],
    'gaji' : [72000, 65000, 98000, 45000, 34000]
})
df

       kota  umur   gaji
0    Malang    44  72000
1  Surabaya    34  65000
2   Jakarta    46  98000
3   Bandung    35  45000
4  Denpasar    23  34000

In [5]:
X = df['kota'].values.reshape(-1,1)
X

array([['Malang'],
       ['Surabaya'],
       ['Jakarta'],
       ['Bandung'],
       ['Denpasar']], dtype=object)

In [6]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray()
X

array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 0., 1., 0., 0.],
       [1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.]])

In [7]:
onehot_encoder.categories_

[array(['Bandung', 'Denpasar', 'Jakarta', 'Malang', 'Surabaya'],
       dtype=object)]

In [8]:
df_onehot = pd.DataFrame(X, columns=[str(i) for i in range(X.shape[1])])
df_onehot

     0    1    2    3    4
0  0.0  0.0  0.0  1.0  0.0
1  0.0  0.0  0.0  0.0  1.0
2  0.0  0.0  1.0  0.0  0.0
3  1.0  0.0  0.0  0.0  0.0
4  0.0  1.0  0.0  0.0  0.0

In [9]:
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2    3    4      kota  umur   gaji
0  0.0  0.0  0.0  1.0  0.0    Malang    44  72000
1  0.0  0.0  0.0  0.0  1.0  Surabaya    34  65000
2  0.0  0.0  1.0  0.0  0.0   Jakarta    46  98000
3  1.0  0.0  0.0  0.0  0.0   Bandung    35  45000
4  0.0  1.0  0.0  0.0  0.0  Denpasar    23  34000

In [10]:
df = df.drop(['kota'], axis = 1)
df

     0    1    2    3    4  umur   gaji
0  0.0  0.0  0.0  1.0  0.0    44  72000
1  0.0  0.0  0.0  0.0  1.0    34  65000
2  0.0  0.0  1.0  0.0  0.0    46  98000
3  1.0  0.0  0.0  0.0  0.0    35  45000
4  0.0  1.0  0.0  0.0  0.0    23  34000